eisup_2019_docmng_integration/src/Documents/ttk_МиграцияДоговоров/ttk_МиграцияДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_МиграцияДоговоров</name>
  <attributes>
    <name>ОрганизацияПередающая</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПринимающая</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ttk_СтатусыМиграцииДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументАвизо</name>
    <type>
      <types>DocumentRef.абс_АВИЗО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетТранзита</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереносаОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РеестрДоговоров</name>
    <attributes>
      <name>CONTRACT_NO</name>
      <comment>Номер договора</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ACCOUNT_NO</name>
      <comment>Номер л\с</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ERP_CODE</name>
      <comment>Код контрагента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CONTRACT_DATE</name>
      <comment>Дата договора</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорПриемник</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольПройден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_МиграцияДоговоров/ttk_МиграцияДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_МиграцияДоговоров</name>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ttk_МиграцияДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорИсточник</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорПриемник</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ИзменениеСтатусовМиграцииДоговоров/ttk_ИзменениеСтатусовМиграцииДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ИзменениеСтатусовМиграцииДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументМиграцииДоговоров</name>
    <type>
      <types>DocumentRef.ttk_МиграцияДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.ttk_СтатусыМиграцииДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ttk_СтатусыМиграцииДоговоров/ttk_СтатусыМиграцииДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ttk_СтатусыМиграцииДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителяДКП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителяДОП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРУ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>Контроль</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ttk_МиграцияДоговоров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.ttk_СтатусыМиграцииДоговоров.Выполнено Тогда
		
		НаборЗаписей = РегистрыСведений.ttk_МиграцияДоговоров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка); 
		НаборЗаписей.Прочитать(); 
		НаборЗаписей.Очистить();
		
		Для Каждого СтрТЧ Из РеестрДоговоров Цикл
			
			Если ЗначениеЗаполнено(СтрТЧ.Контрагент) И
				ЗначениеЗаполнено(СтрТЧ.Договор) И
				ЗначениеЗаполнено(СтрТЧ.ДоговорПриемник) Тогда
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				НоваяЗапись.Дата            = НачалоМесяца(ДатаПереносаОстатков);
				НоваяЗапись.Документ        = Ссылка;
				НоваяЗапись.Ответственный   = Ответственный;
				
				НоваяЗапись.ДоговорИсточник = СтрТЧ.Договор;
				НоваяЗапись.ДоговорПриемник = СтрТЧ.ДоговорПриемник;
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(ОрганизацияПередающая) Тогда
		Сообщить("Не заполнена передающая организация");
		Отказ = Истина;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОрганизацияПринимающая) Тогда
		Сообщить("Не заполнена принимающая организация");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаПереносаОстатков) Тогда
		Сообщить("Не заполнена дата ввода остатков");
		Отказ = Истина;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого СтрТЧ ИЗ РеестрДоговоров Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.Договор) Тогда
				Сообщить("В строке " + СтрТЧ.НомерСтроки + " не заполнен договор источник! Заполните");	
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ДоговорПриемник) Тогда
				Сообщить("В строке " + СтрТЧ.НомерСтроки + " не заполнен договор Приемник! Заполните");	
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	НаборЗаписей = РегистрыСведений.ttk_МиграцияДоговоров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка); 
	НаборЗаписей.Прочитать(); 
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено, ИмяПользователя = "") Экспорт
	
	// АБС Новоселов+ вставка Может передаваться имя пользователя ИСУЗК
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда 
		ТекПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
		Если Не ЗначениеЗаполнено(ТекПользователь) Тогда 
			ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
		КонецЕсли;
	Иначе// АБС Новоселов-	
		ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ttk_ИзменениеСтатусовМиграцииДоговоров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДокументМиграцииДоговоров.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();

	Запись.ДокументМиграцииДоговоров = Ссылка;
	Запись.Пользователь 			 = ТекПользователь;	
	Запись.Статус					 = НовыйСтатус;
	
	Запись.Комментарий 				 = Комментарий;
	
	ОтветственныйСотрудник = абс_БизнесПроцессы.ПолучитьСотрудникаПользователя(ТекПользователь);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Попытка 	
		СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусМиграцииДоговоровПоРегистру(Ссылка);	
		Если НЕ Статус = СтатусПоРегистру Тогда
			ЗаписатьНовыйСтатус(Статус, ""); // абс_ПричинаИзмененияСтатуса); Лапин Закоментил, все равно причин никто не вводит почти
		КонецЕсли;                                                                                		
	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при записи документа: " + ОписаниеОшибки() + ".", Отказ);		
		Возврат;    		
	КонецПопытки;		
	
КонецПроцедуры
